#####################################################################################################################
################################################## Test data: #######################################################
#####################################################################################################################
# Count: 9
#Иванов П.М. 555-66-77
#Шишкин З.В. 555-66-76
#Леснов С.П. 555-66-75
#Селезнёв Р.С. 555-66-76
#Петров А.В. 555-66-77
#Симонов Д.М. 555-66-75
#Шишов В.Г. 555-66-77
#Сизов В.Г. 555-66-76
#Соболев В.Г. 555-66-77
#####################################################################################################################
##################################################### Funcs: ########################################################
#####################################################################################################################
def main():
    employees_count = int(input("Количество сотрудников: "))
    subdivision_dict = dict()
    print("Введите имена участников:")
    employee_index = 0
    while employee_index < employees_count:
        employee_index += 1

        input_strings = input()
        phone_number = None

        # Обработка данных участника.
        surname, initials, phone_number = input_strings.split(" ")
       
        if len(surname) > 20:
            print("Фамилия слишком длинная!")
            print("Повторите попытку ввода.")
            continue

        if len(initials) > 4:
            print("Инициалы слишком длинные!")
            print("Повторите попытку ввода.")
            continue
        
        if len(phone_number) > 9:
            print("Номер телефона слишком длинный!")
            print("Повторите попытку ввода.")
            continue

        if (phone_number[3] != '-') or (phone_number[6] != '-'):
            print("Номер телефона некорректный!")
            print("Повторите попытку ввода.")
            continue

        subdivision = phone_number.split("-")[2]
        if subdivision in subdivision_dict:
            subdivision_dict[subdivision] += 1
        else:
            subdivision_dict[subdivision] = 1

    # сред.кол.сотрудников на подразделение =  кол.сотрудников / кол.подразделений
    average_amount = employees_count / len(subdivision_dict)
    print("в среднем сотрудников работает в одном подразделении: %i" % average_amount)
#####################################################################################################################
##################################################### Exec: #########################################################
#####################################################################################################################
main()